ERP.belugaerp/src/Catalogs/битПунктыНазначения/битПунктыНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битПунктыНазначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>GLNКодМагазина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>700</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресГеокодирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйСрокДоОкончанияЛицензии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаРазгрузкиСтраховойКомпании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторCRM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналПродаж</name>
    <type>
      <types>CatalogRef.битКаналыПродаж</types>
      <types>CatalogRef.бг_УдалитьКаналыПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТТSY</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛичноеПоручительствоПунктаРазгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.бг_МаршрутыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЛогист</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменСМТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСБ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.битТерриторииПунктовНазначения</types>
      <types>CatalogRef.бг_УдалитьТерриторииПунктовНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьАктПерегрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонMarker2ПакетаSOLVOWMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонMarkerПакетаSOLVOWMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАльтернативныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоФилиал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/InformationRegisters/бг_МенеджерыПунктовНазначения/бг_МенеджерыПунктовНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_МенеджерыПунктовНазначения</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутТорговогоПредставителя</name>
    <type>
      <types>CatalogRef.бг_МаршрутыТорговыхПредставителей</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакЭТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_EDI_ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_EDI_Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_GLNПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВыгружатьШтрихкодEAN13ВТТНЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЗаполнятьДопДанныеВИсхТТНЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИнформацияЧКН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодКлиентаSY</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодПроизводителейИМаркировщиковИмпорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КППКрупнейшегоНалогоплательщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЛичноеПоручительство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_МакетПечатныхФорм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НаименованиеКонтрагентаВБанкеФакторе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОтгружатьВЗаказеТолькоОднуПартию</name>
    <comment>При автоматическом заполнении упаковок в заказе будет подбираться только одна упаковка</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_РазделятьРеализацииПоСериямНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_РозничныйПокупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Тикер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ФирмаПроизводитель</name>
    <type>
      <types>CatalogRef.бг_ЕК_СКЮ_Фирмы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЦФО</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/битПунктыНазначения/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Определяет пункт назначения объекта
//
// Параметры:
//	Объект	- ДокументСсылка.ЗаказКлиента - Объект, пункт назначения которого определяем
//
// Возвращаемое значение:	
//	СправочникСсылка.битПунктыНазначения - Пункт назначения объекта (по умолчанию пустая ссылка)
//
Функция ПунктНазначенияОбъекта(Объект) Экспорт
	Результат = Справочники.битПунктыНазначения.ПустаяСсылка();
	
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЗаказРозничногоПокупателя.бг_ПунктНазначения, ЗаказКлиента.бг_ПунктНазначения) КАК бг_ПунктНазначения
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказРозничногоПокупателя
		|		ПО ЗаказКлиента.бг_ЗаказРозничногоПокупателя = ЗаказРозничногоПокупателя.Ссылка
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Объект);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Результат = Выборка.бг_ПунктНазначения;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Определяет пункт назначения объекта
//
// Параметры:
//	ПунктыНазначения	- Массив из СправочникСсылка.битПунктыНазначения - пункты назначения, для которых определяем маршрут
//
// Возвращаемое значение:	
//	Строка
//
Функция МаршрутПунктовНазначения(ПунктыНазначения) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПунктыНазначения", ПунктыНазначения);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	IsNULL(битПунктыНазначения.Маршрут.Наименование, """") КАК Маршрут
	|ИЗ
	|	Справочник.битПунктыНазначения КАК битПунктыНазначения
	|ГДЕ
	|	битПунктыНазначения.Ссылка В (&ПунктыНазначения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Маршрут";
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", ", ") + Выборка.Маршрут;
	КонецЦикла;                                                                       
	Возврат Результат;
КонецФункции

// Пытается геокодировать координаты для переданного адреса
//
// Параметры:
//	Адрес	- Строка - адрес для геокодирования
//	Широта	- Число - результат геокодирования широта
//	Долгота	- Число - результат геокодирования долгота
//
Процедура ГеокодироватьАдрес(Знач Адрес, Широта, Долгота) Экспорт
	Адрес = КодироватьСтроку(Адрес, СпособКодированияСтроки.КодировкаURL);
	ЯндексГеокодерПараметры = бг_КонстантыПовтИсп.ЗначенияКонстант("ЯндексГеокодерАдресСервиса, ЯндексГеокодерПользователь");
	АдресСервиса = УбратьHTTP(ЯндексГеокодерПараметры.ЯндексГеокодерАдресСервиса);
    АпиКлюч = ЯндексГеокодерПараметры.ЯндексГеокодерПользователь;
	Если ПустаяСтрока(АдресСервиса) Тогда
		ТекстОшибки = НСтр("ru='Не заданы параметры сервиса геокодирования. Обратитесь к администратору'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	СервисГеокодирования = УстановитьСоединение(АдресСервиса);
	HTTPЗапрос = ЗапросGet(АдресСервиса, АпиКлюч, Адрес);
	HTTPОтвет = СервисГеокодирования.Получить(HTTPЗапрос);
	Результат = Неопределено;
	ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	Если HTTPОтвет.КодСостояния = 200 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		РезультатЗапроса = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Иначе 
		ТекстОшибки = НСтр("ru='Код ошибки: %1.
							|%2'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, HTTPОтвет.КодСостояния, ТелоОтвета);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если РезультатЗапроса.response.GeoObjectCollection.featureMember.Количество() >= 1 Тогда
		ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(10, 7);
		ДолготаШиротаСтрока = СокрЛП(РезультатЗапроса.response.GeoObjectCollection.featureMember[0].GeoObject.Point.pos);
		ПозПробел = СтрНайти(ДолготаШиротаСтрока, " ");
		Долгота = ТипЧисло.ПривестиЗначение(Лев(ДолготаШиротаСтрока, ПозПробел - 1));
		Широта = ТипЧисло.ПривестиЗначение(Сред(ДолготаШиротаСтрока, ПозПробел + 1));
	Иначе
		ТекстОшибки  = НСтр("ru='Не удалось геокодировать адрес. Возможно некоторые поля адреса запонены некорректно.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
КонецПроцедуры                                  

// Возвращает сформированное полное наименование пункта назначения
//
// Параметры:
//  Клиент - Справочник.Контрагенты
//
// Возвращаемое значение:
//  Строка
//
Функция ПолноеНаименованиеПунктаНазначенияПоДаннымКонтрагента(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.ГоловнойКонтрагент.НаименованиеПолное КАК НаименованиеПолное
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.НаименованиеПолное;
	
КонецФункции

// Возвращает структуру с данными записи регистра Менеджеры пунктов назначения,
// в случае отсутсвия записи с переданным в параметрах менеджером,
// создает новую запись
//
// Параметры:
//  ПунктНазначения - Справочник.битПунктыНазначения
//  Менеджер - Справочник.ФизическиеЛица
//
// Возвращаемое значение:
//  Структура
//
Функция НайтиСоздатьЗаписьМенеджераПунктаНазначения(ПунктНазначения, Менеджер) Экспорт
	
	ДанныеЗаписи = РегистрыСведений.бг_МенеджерыПунктовНазначения.НайтиЗаписьМенеджераПунктаНазначения(
					ПунктНазначения, 
					Менеджер);
					
	Если ДанныеЗаписи.Менеджер <> Менеджер Тогда
		
		РегистрыСведений.бг_МенеджерыПунктовНазначения.СоздатьЗаписьМенеджераПунктаНазначения(
			ПунктНазначения,
			Менеджер);
		
	КонецЕсли;
		
	Возврат ДанныеЗаписи;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УбратьHTTP(АдресСервиса)
	Если Лев(АдресСервиса, 8) = "https://" Тогда
		Результат = Сред(АдресСервиса, 9);
	ИначеЕсли Лев(АдресСервиса, 7) = "http://" Тогда
		Результат = Сред(АдресСервиса, 8);
	Иначе
		Результат = АдресСервиса;
	КонецЕсли;   
	Возврат Результат;
КонецФункции

Функция УстановитьСоединение(Знач АдресСервиса) 
	Поз = СтрНайти(АдресСервиса, "/");
	Если Поз > 0 Тогда
		АдресСервиса = Лев(АдресСервиса, Поз - 1);
	КонецЕсли;
	Попытка
		HTTPСоединение = Новый HTTPСоединение(АдресСервиса);
	Исключение
		ТекстОшибки = НСтр("ru='Не удалось установить соединение с сервисом %1'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, АдресСервиса);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	Возврат HTTPСоединение;
КонецФункции

Функция ЗапросGet(Знач АдресСервиса, Знач Apikey, Знач Адрес)
	Поз = СтрНайти(АдресСервиса, "/");
	Если Поз > 0 Тогда
		ТекстЗапроса = Сред(АдресСервиса, Поз);
	Иначе
		ТекстЗапроса = "";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "/?apikey=" + Apikey + "&format=json&geocode=" + Адрес;
	Заголовки = Новый Соответствие;
	Возврат Новый HTTPЗапрос(ТекстЗапроса, Заголовки);
КонецФункции

#КонецОбласти
